espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>RD_REPEAT_DATA3</name>
          <description>BLOCK0 data register 4.</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIS_DOWNLOAD_MODE</name>
              <description>Set this bit to disable download mode (boot_mode[3:0] = 0, 1, 2, 3, 6, 7).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_LEGACY_SPI_BOOT</name>
              <description>Set this bit to disable Legacy SPI boot mode (boot_mode[3:0] = 4).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CHANNEL</name>
              <description>Selectes the default UART print channel. 0: UART0. 1: UART1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_ECC_MODE</name>
              <description>Set ECC mode in ROM, 0: ROM would Enable Flash ECC 16to18 byte mode. 1:ROM would use 16to17 byte mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_DOWNLOAD_MODE</name>
              <description>Set this bit to disable UART download mode through USB.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_SECURITY_DOWNLOAD</name>
              <description>Set this bit to enable secure UART download mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CONTROL</name>
              <description>Set the default UARTboot message output mode. 00: Enabled. 01: Enabled when GPIO8 is low at reset. 10: Enabled when GPIO8 is high at reset. 11:disabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN_POWER_SELECTION</name>
              <description>GPIO33-GPIO37 power supply selection in ROM code. 0: VDD3P3_CPU. 1: VDD_SPI.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TYPE</name>
              <description>Set the maximum lines of SPI flash. 0: four lines. 1: eight lines.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_PAGE_SIZE</name>
              <description>Set Flash page size.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_ECC_EN</name>
              <description>Set 1 to enable ECC for flash boot.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SEND_RESUME</name>
              <description>Set this bit to force ROM code to send a resume command during SPI boot.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_VERSION</name>
              <description>Secure version (used by ESP-IDF anti-rollback feature).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POWERGLITCH_EN</name>
              <description>Set this bit to enable power glitch function.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RPT4_RESERVED1</name>
              <description>Reserved (used for four backups method).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA4</name>
          <description>BLOCK0 data register 5.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RPT4_RESERVED2</name>
              <description>Reserved (used for four backups method).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SPI_SYS_0</name>
          <description>BLOCK1 data register 0.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAC_0</name>
              <description>Stores the low 32 bits of MAC address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SPI_SYS_1</name>
          <description>BLOCK1 data register 1.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAC_1</name>
              <description>Stores the high 16 bits of MAC address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_PAD_CONF_0</name>
              <description>Stores the zeroth part of SPI_PAD_CONF.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SPI_SYS_2</name>
          <description>BLOCK1 data register 2.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI_PAD_CONF_1</name>
              <description>Stores the first part of SPI_PAD_CONF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SPI_SYS_3</name>
          <description>BLOCK1 data register 3.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPI_PAD_CONF_2</name>
              <description>Stores the second part of SPI_PAD_CONF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_DATA_PART0_0</name>
              <description>Stores the fist 14 bits of the zeroth part of system data.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SPI_SYS_4</name>
          <description>BLOCK1 data register 4.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART0_1</name>
              <description>Stores the fist 32 bits of the zeroth part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SPI_SYS_5</name>
          <description>BLOCK1 data register 5.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART0_2</name>
              <description>Stores the second 32 bits of the zeroth part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA0</name>
          <description>Register 0 of BLOCK2 (system).</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_0</name>
              <description>Stores the zeroth 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA1</name>
          <description>Register 1 of BLOCK2 (system).</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_1</name>
              <description>Stores the first 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA2</name>
          <description>Register 2 of BLOCK2 (system).</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_2</name>
              <description>Stores the second 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA3</name>
          <description>Register 3 of BLOCK2 (system).</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_3</name>
              <description>Stores the third 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA4</name>
          <description>Register 4 of BLOCK2 (system).</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_4</name>
              <description>Stores the fourth 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA5</name>
          <description>Register 5 of BLOCK2 (system).</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_5</name>
              <description>Stores the fifth 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA6</name>
          <description>Register 6 of BLOCK2 (system).</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_6</name>
              <description>Stores the sixth 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_SYS_PART1_DATA7</name>
          <description>Register 7 of BLOCK2 (system).</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART1_7</name>
              <description>Stores the seventh 32 bits of the first part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA0</name>
          <description>Register 0 of BLOCK3 (user).</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA0</name>
              <description>Stores the zeroth 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA1</name>
          <description>Register 1 of BLOCK3 (user).</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA1</name>
              <description>Stores the first 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA2</name>
          <description>Register 2 of BLOCK3 (user).</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA2</name>
              <description>Stores the second 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA3</name>
          <description>Register 3 of BLOCK3 (user).</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA3</name>
              <description>Stores the third 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA4</name>
          <description>Register 4 of BLOCK3 (user).</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA4</name>
              <description>Stores the fourth 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA5</name>
          <description>Register 5 of BLOCK3 (user).</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA5</name>
              <description>Stores the fifth 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA6</name>
          <description>Register 6 of BLOCK3 (user).</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA6</name>
              <description>Stores the sixth 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_USR_DATA7</name>
          <description>Register 7 of BLOCK3 (user).</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USR_DATA7</name>
              <description>Stores the seventh 32 bits of BLOCK3 (user).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA0</name>
          <description>Register 0 of BLOCK4 (KEY0).</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA0</name>
              <description>Stores the zeroth 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA1</name>
          <description>Register 1 of BLOCK4 (KEY0).</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA1</name>
              <description>Stores the first 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA2</name>
          <description>Register 2 of BLOCK4 (KEY0).</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA2</name>
              <description>Stores the second 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA3</name>
          <description>Register 3 of BLOCK4 (KEY0).</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA3</name>
              <description>Stores the third 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA4</name>
          <description>Register 4 of BLOCK4 (KEY0).</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA4</name>
              <description>Stores the fourth 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA5</name>
          <description>Register 5 of BLOCK4 (KEY0).</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA5</name>
              <description>Stores the fifth 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA6</name>
          <description>Register 6 of BLOCK4 (KEY0).</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA6</name>
              <description>Stores the sixth 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY0_DATA7</name>
          <description>Register 7 of BLOCK4 (KEY0).</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY0_DATA7</name>
              <description>Stores the seventh 32 bits of KEY0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY1_DATA0</name>
          <description>Register 0 of BLOCK5 (KEY1).</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA0</name>
              <description>Stores the zeroth 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY1_DATA1</name>
          <description>Register 1 of BLOCK5 (KEY1).</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA1</name>
              <description>Stores the first 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_KEY1_DATA2</name>
          <description>Register 2 of BLOCK5 (KEY1).</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY1_DATA2</name>
              <description>Stores the second 32 bits of KEY1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
