espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>RD_SYS_PART2_DATA7</name>
          <description>Register 7 of BLOCK10 (system).</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYS_DATA_PART2_7</name>
              <description>Stores the 7th 32 bits of the 2nd part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_ERR0</name>
          <description>Programming error record register 0 of BLOCK0.</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RD_DIS_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_RTC_RAM_BOOT_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_ICACHE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DCACHE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_ICACHE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_DCACHE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_FORCE_DOWNLOAD_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_CAN_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_APP_CPU_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_DIS_JTAG_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_PAD_JTAG_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_DREFH_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_DREFL_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_EXCHG_PINS_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_PHY_ENABLE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BTLC_GPIO_ENABLE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_MODECURLIM_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_DREFH_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_ERR1</name>
          <description>Programming error record register 1 of BLOCK0.</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VDD_SPI_DREFM_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_DREFL_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_XPD_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_TIEH_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_FORCE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_EN_INIT_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_ENCURLIM_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_DCURLIM_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_INIT_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_DCAP_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_DELAY_SEL_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_BOOT_CRYPT_CNT_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE0_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE1_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE2_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_0_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_1_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_ERR2</name>
          <description>Programming error record register 2 of BLOCK0.</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY_PURPOSE_2_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_3_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_4_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_5_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RPT4_RESERVED0_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_EN_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_AGGRESSIVE_REVOKE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_JTAG_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_DEVICE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STRAP_JTAG_SEL_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_PHY_SEL_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POWER_GLITCH_DSENSE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TPUW_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_ERR3</name>
          <description>Programming error record register 3 of BLOCK0.</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIS_DOWNLOAD_MODE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_LEGACY_SPI_BOOT_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CHANNEL_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_ECC_MODE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_DOWNLOAD_MODE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_SECURITY_DOWNLOAD_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CONTROL_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN_POWER_SELECTION_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TYPE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_PAGE_SIZE_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_ECC_EN_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SEND_RESUME_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_VERSION_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POWERGLITCH_EN_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RPT4_RESERVED1_ERR</name>
              <description>Reserved.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_ERR4</name>
          <description>Programming error record register 4 of BLOCK0.</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RPT4_RESERVED2_ERR</name>
              <description>If any bits in this filed are 1, then it indicates a programming error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
