espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>CAP_TIMER_PHASE</name>
          <description>Phase for capture timer sync</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP_PHASE</name>
              <description>Phase value for capture timer sync operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH0_CFG</name>
          <description>Capture channel 0 configuration and enable</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP0_EN</name>
              <description>When set, capture on channel 0 is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_MODE</name>
              <description>Edge of capture on channel 0 after prescaling. When bit0 is set to 1: enable capture on the negative edge, When bit1 is set to 1: enable capture on the positive edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_PRESCALE</name>
              <description>Value of prescaling on possitive edge of CAP0. Prescale value = PWM_CAP0_PRESCALE + 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_IN_INVERT</name>
              <description>when set, CAP0 form GPIO matrix is inverted before prescale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_SW</name>
              <description>Write 1 will trigger a software forced capture on channel 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH1_CFG</name>
          <description>Capture channel 1 configuration and enable</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP1_EN</name>
              <description>When set, capture on channel 2 is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_MODE</name>
              <description>Edge of capture on channel 1 after prescaling. When bit0 is set to 1: enable capture on the negative edge, When bit1 is set to 1: enable capture on the positive edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_PRESCALE</name>
              <description>Value of prescaling on possitive edge of CAP1. Prescale value = PWM_CAP1_PRESCALE + 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_IN_INVERT</name>
              <description>when set, CAP1 form GPIO matrix is inverted before prescale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_SW</name>
              <description>Write 1 will trigger a software forced capture on channel 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH2_CFG</name>
          <description>Capture channel 2 configuration and enable</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP2_EN</name>
              <description>When set, capture on channel 2 is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_MODE</name>
              <description>Edge of capture on channel 2 after prescaling. When bit0 is set to 1: enable capture on the negative edge, When bit1 is set to 1: enable capture on the positive edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_PRESCALE</name>
              <description>Value of prescaling on possitive edge of CAP2. Prescale value = PWM_CAP2_PRESCALE + 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_IN_INVERT</name>
              <description>when set, CAP2 form GPIO matrix is inverted before prescale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_SW</name>
              <description>Write 1 will trigger a software forced capture on channel 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH0</name>
          <description>Value of last capture on channel 0</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP0_VALUE</name>
              <description>Value of last capture on channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH1</name>
          <description>Value of last capture on channel 1</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP1_VALUE</name>
              <description>Value of last capture on channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CH2</name>
          <description>Value of last capture on channel 2</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP2_VALUE</name>
              <description>Value of last capture on channel 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_STATUS</name>
          <description>Edge of last capture trigger</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP0_EDGE</name>
              <description>Edge of last capture trigger on channel 0, 0: posedge, 1: negedge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP1_EDGE</name>
              <description>Edge of last capture trigger on channel 1, 0: posedge, 1: negedge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP2_EDGE</name>
              <description>Edge of last capture trigger on channel 2, 0: posedge, 1: negedge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPDATE_CFG</name>
          <description>Enable update.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000055</resetValue>
          <fields>
            <field>
              <name>GLOBAL_UP_EN</name>
              <description>The global enable of update of all active registers in MCPWM module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLOBAL_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of all active registers in MCPWM module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 0 are enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 1 are enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 2 are enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER0_STOP_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when the timer 0 stops.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_STOP_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when the timer 1 stops.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_STOP_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when the timer 2 stops.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEZ_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 0 TEZ event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEZ_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 1 TEZ event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEZ_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 2 TEZ event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEP_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 0 TEP event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEP_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 1 TEP event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEP_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 2 TEP event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when event_f0 starts.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when event_f1 starts.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when event_f2 starts.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0_CLR_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when event_f0 ends.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1_CLR_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when event_f1 ends.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2_CLR_INT_ENA</name>
              <description>The enable bit for the interrupt triggered when event_f2 ends.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEA_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 0 TEA event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEA_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 1 TEA event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEA_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 2 TEA event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEB_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 0 TEB event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEB_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 1 TEB event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEB_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 2 TEB event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_CBC_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a cycle-by-cycle mode action on PWM0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_CBC_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a cycle-by-cycle mode action on PWM1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_CBC_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a cycle-by-cycle mode action on PWM2.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_OST_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a one-shot mode action on PWM0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_OST_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a one-shot mode action on PWM1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_OST_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by a one-shot mode action on PWM2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by capture on channel 0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by capture on channel 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2_INT_ENA</name>
              <description>The enable bit for the interrupt triggered by capture on channel 2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
