espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>SAR_TOUCH_STATUS8</name>
          <description>touch channel status of touch pad 8</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD8_DATA</name>
              <description>touch data debounce of touch pad 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD8_DEBOUNCE</name>
              <description>touch current debounce of touch pad 8</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS9</name>
          <description>touch channel status of touch pad 9</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD9_DATA</name>
              <description>touch data debounce of touch pad 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD9_DEBOUNCE</name>
              <description>touch current debounce of touch pad 9</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS10</name>
          <description>touch channel status of touch pad 10</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD10_DATA</name>
              <description>touch data debounce of touch pad 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD10_DEBOUNCE</name>
              <description>touch current debounce of touch pad 10</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS11</name>
          <description>touch channel status of touch pad 11</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD11_DATA</name>
              <description>touch data debounce of touch pad 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD11_DEBOUNCE</name>
              <description>touch current debounce of touch pad 11</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS12</name>
          <description>touch channel status of touch pad 12</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD12_DATA</name>
              <description>touch data debounce of touch pad 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD12_DEBOUNCE</name>
              <description>touch current debounce of touch pad 12</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS13</name>
          <description>touch channel status of touch pad 13</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD13_DATA</name>
              <description>touch data debounce of touch pad 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD13_DEBOUNCE</name>
              <description>touch current debounce of touch pad 13</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS14</name>
          <description>touch channel status of touch pad 14</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_PAD14_DATA</name>
              <description>touch data debounce of touch pad 14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_PAD14_DEBOUNCE</name>
              <description>touch current debounce of touch pad 14</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS15</name>
          <description>touch channel status of sleep pad</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_SLP_DATA</name>
              <description>touch data debounce of sleep pad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_SLP_DEBOUNCE</name>
              <description>touch current debounce of sleep pad</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TOUCH_STATUS16</name>
          <description>touch channel status of approach mode</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_TOUCH_APPROACH_PAD2_CNT</name>
              <description>touch current approach count of approach pad2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_APPROACH_PAD1_CNT</name>
              <description>touch current approach count of approach pad1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_APPROACH_PAD0_CNT</name>
              <description>touch current approach count of approach pad0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_TOUCH_SLP_APPROACH_CNT</name>
              <description>touch current approach count of slp pad</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_STATE</name>
          <description>get cocpu status</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_DBG_TRIGGER</name>
              <description>trigger cocpu debug registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_CLK_EN_ST</name>
              <description>check cocpu whether clk on</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_RESET_N</name>
              <description>check cocpu whether in reset state</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_EOI</name>
              <description>check cocpu whether in interrupt state</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TRAP</name>
              <description>check cocpu whether in trap state</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_EBREAK</name>
              <description>check cocpu whether in ebreak</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_RAW</name>
          <description>the interrupt raw of ulp</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_RAW</name>
              <description>int from touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_RAW</name>
              <description>int from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_RAW</name>
              <description>int from touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_RAW</name>
              <description>int from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_RAW</name>
              <description>int from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_RAW</name>
              <description>int from tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_RAW</name>
              <description>int from start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_RAW</name>
              <description>int from software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_RAW</name>
              <description>int from super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_RAW</name>
              <description>int from timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_RAW</name>
              <description>int from approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_RAW</name>
              <description>int from touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ENA</name>
          <description>the interrupt enable of ulp</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_ENA</name>
              <description>int enable of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_ENA</name>
              <description>int enable of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_ENA</name>
              <description>int enable of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_ENA</name>
              <description>int enable of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_ENA</name>
              <description>int enable of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_ENA</name>
              <description>int enable of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_ENA</name>
              <description>int enable of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_ENA</name>
              <description>int enable of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_ENA</name>
              <description>int enable of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_ENA</name>
              <description>int enable of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA</name>
              <description>int enable of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_ENA</name>
              <description>int enable of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ST</name>
          <description>the interrupt state of ulp</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_ST</name>
              <description>int state of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_ST</name>
              <description>int state of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_ST</name>
              <description>int state of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_ST</name>
              <description>int state of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_ST</name>
              <description>int state of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_ST</name>
              <description>int state of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_ST</name>
              <description>int state of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_ST</name>
              <description>int state of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_ST</name>
              <description>int state of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_ST</name>
              <description>int state of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ST</name>
              <description>int state of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_ST</name>
              <description>int state of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
