espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>SAR_COCPU_INT_CLR</name>
          <description>the interrupt clear of ulp</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_CLR</name>
              <description>int clear of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_CLR</name>
              <description>int clear of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_CLR</name>
              <description>int clear of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_CLR</name>
              <description>int clear of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_CLR</name>
              <description>int clear of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_CLR</name>
              <description>int clear of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_CLR</name>
              <description>int clear of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_CLR</name>
              <description>int clear of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_CLR</name>
              <description>int clear of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_CLR</name>
              <description>int clear of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_CLR</name>
              <description>int clear of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_CLR</name>
              <description>int clear of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_DEBUG</name>
          <description>Ulp-riscv debug signal</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_PC</name>
              <description>cocpu Program counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_MEM_VLD</name>
              <description>cocpu mem valid output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_MEM_RDY</name>
              <description>cocpu mem ready input</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_MEM_WEN</name>
              <description>cocpu mem write enable output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_MEM_ADDR</name>
              <description>cocpu mem address output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_HALL_CTRL</name>
          <description>no public</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0xA0000000</resetValue>
          <fields>
            <field>
              <name>SAR_XPD_HALL</name>
              <description>Power on hall sensor and connect to VP and VN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_XPD_HALL_FORCE</name>
              <description>1: XPD HALL is controlled by SW. 0: XPD HALL is controlled by FSM in ULP-coprocessor</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_HALL_PHASE</name>
              <description>Reverse phase of hall sensor</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_HALL_PHASE_FORCE</name>
              <description>1: HALL PHASE is controlled by SW  0: HALL PHASE is controlled by FSM in ULP-coprocessor</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_NOUSE</name>
          <description>no public</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_NOUSE</name>
              <description>no public</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_PERI_CLK_GATE_CONF</name>
          <description>the peri clock gate of rtc  peri</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_RTC_I2C_CLK_EN</name>
              <description>enable rtc i2c clock</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_CLK_EN</name>
              <description>enable tsens clock</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SARADC_CLK_EN</name>
              <description>enbale saradc clock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_IOMUX_CLK_EN</name>
              <description>enable io_mux clock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_PERI_RESET_CONF</name>
          <description>the peri reset of rtc  peri</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_RESET</name>
              <description>enable ulp-riscv reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_RTC_I2C_RESET</name>
              <description>Reserved.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_TSENS_RESET</name>
              <description>enbale saradc reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SARADC_RESET</name>
              <description>enable io_mux reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ENA_W1TS</name>
          <description>the interrupt enable of ulp</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_ENA_W1TS</name>
              <description>int enable of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS</name>
              <description>int enable of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS</name>
              <description>int enable of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_ENA_W1TS</name>
              <description>int enable of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_ENA_W1TS</name>
              <description>int enable of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_ENA_W1TS</name>
              <description>int enable of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_ENA_W1TS</name>
              <description>int enable of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_ENA_W1TS</name>
              <description>int enable of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_ENA_W1TS</name>
              <description>int enable of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS</name>
              <description>int enable of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS</name>
              <description>int enable of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS</name>
              <description>int enable of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ENA_W1TC</name>
          <description>the interrupt enable clear of ulp</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_ENA_W1TC</name>
              <description>Clear int enable of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC</name>
              <description>Clear int enable of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC</name>
              <description>Clear int enable of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_ENA_W1TC</name>
              <description>Clear int enable of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_ENA_W1TC</name>
              <description>Clear int enable of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_ENA_W1TC</name>
              <description>Clear int enable of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_ENA_W1TC</name>
              <description>Clear int enable of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_ENA_W1TC</name>
              <description>Clear int enable of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_ENA_W1TC</name>
              <description>Clear int enable of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC</name>
              <description>Clear int enable of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC</name>
              <description>Clear int enable of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC</name>
              <description>Clear int enable of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_DEBUG_CONF</name>
          <description>rtc peri debug configure</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_DEBUG_BIT_SEL</name>
              <description>no public</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SARDATE</name>
          <description>version</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02101180</resetValue>
          <fields>
            <field>
              <name>SAR_DATE</name>
              <description>version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
