espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_1</name>
          <description>i2s1 dma permission configuration register 1.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>i2s1's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>i2s1's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>i2s1's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>i2s1's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>i2s1's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_I2S1_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>i2s1's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_0</name>
          <description>mac dma permission configuration register 0.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock mac dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_1</name>
          <description>mac dma permission configuration register 1.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>mac's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>mac's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>mac's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>mac's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>mac's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_MAC_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>mac's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_0</name>
          <description>backup dma permission configuration register 0.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock backup dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_1</name>
          <description>backup dma permission configuration register 1.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>backup's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>backup's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>backup's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>backup's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>backup's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_BACKUP_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>backup's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_AES_PMS_CONSTRAIN_0</name>
          <description>aes dma permission configuration register 0.</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock aes dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_AES_PMS_CONSTRAIN_1</name>
          <description>aes dma permission configuration register 1.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>aes's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>aes's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>aes's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>aes's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>aes's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_AES_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>aes's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_0</name>
          <description>sha dma permission configuration register 0.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock sha dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_1</name>
          <description>sha dma permission configuration register 1.</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>sha's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>sha's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>sha's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>sha's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>sha's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SHA_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>sha's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_0</name>
          <description>adc_dac dma permission configuration register 0.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock adc_dac dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_1</name>
          <description>adc_dac dma permission configuration register 1.</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>adc_dac's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>adc_dac's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>adc_dac's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>adc_dac's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>adc_dac's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>adc_dac's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_0</name>
          <description>rmt dma permission configuration register 0.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock rmt dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_1</name>
          <description>rmt dma permission configuration register 1.</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>rmt's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>rmt's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>rmt's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>rmt's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>rmt's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_RMT_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>rmt's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_0</name>
          <description>lcd_cam dma permission configuration register 0.</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock lcd_cam dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_1</name>
          <description>lcd_cam dma permission configuration register 1.</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>lcd_cam's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>lcd_cam's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>lcd_cam's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>lcd_cam's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>lcd_cam's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LCD_CAM_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>lcd_cam's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_USB_PMS_CONSTRAIN_0</name>
          <description>usb dma permission configuration register 0.</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_USB_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock usb dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
