espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>DMA_APBPERI_USB_PMS_CONSTRAIN_1</name>
          <description>usb dma permission configuration register 1.</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_USB_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>usb's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_USB_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>usb's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_USB_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>usb's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_USB_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>usb's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_USB_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>usb's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_USB_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>usb's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_LC_PMS_CONSTRAIN_0</name>
          <description>lc dma permission configuration register 0.</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock lc dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_LC_PMS_CONSTRAIN_1</name>
          <description>lc dma permission configuration register 1.</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>lc's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>lc's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>lc's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>lc's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>lc's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_LC_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>lc's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_0</name>
          <description>sdio dma permission configuration register 0.</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock sdio dma permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_1</name>
          <description>sdio dma permission configuration register 1.</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_SRAM_PMS_0</name>
              <description>sdio's permission(store,load) in data region0 of SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_SRAM_PMS_1</name>
              <description>sdio's permission(store,load) in data region1 of SRAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_SRAM_PMS_2</name>
              <description>sdio's permission(store,load) in data region2 of SRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_SRAM_PMS_3</name>
              <description>sdio's permission(store,load) in data region3 of SRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_0</name>
              <description>sdio's permission(store,load) in dcache data sram block0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_SDIO_PMS_CONSTRAIN_SRAM_CACHEDATAARRAY_PMS_1</name>
              <description>sdio's permission(store,load) in dcache data sram block1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_0</name>
          <description>dma permission monitor configuration register 0.</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_LOCK</name>
              <description>Set 1 to lock  dma permission monitor Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_1</name>
          <description>dma permission monitor configuration register 1.</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_CLR</name>
              <description>Set 1 to clear dma_pms_monitor_violate interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_EN</name>
              <description>Set 1 to enable dma pms monitor, if dma access violated permission, will trigger interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_2</name>
          <description>dma permission monitor configuration register 2.</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR</name>
              <description>recorded dma's interrupt status when dma access violated permission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>recorded dma's world status when dma access violated permission</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>recorded dma's address bit[25:4] status when dma access violated permission, real address is 0x3c00_0000+addr*16</description>
              <bitOffset>3</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APBPERI_PMS_MONITOR_3</name>
          <description>dma permission monitor configuration register 3.</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>recorded dma's write status when dma access violated permission, 1(write), 0(read)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_APBPERI_PMS_MONITOR_VIOLATE_STATUS_BYTEEN</name>
              <description>recorded dma's byte enable status when dma access violated permission</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_0</name>
          <description>sram split line configuration register 0</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock sram split configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_1</name>
          <description>sram split line configuration register 1</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_0</name>
              <description>category0 of core_x_iram0_dram_dma_line, if the splitaddress in block0 of SRAM, configured as 0x10, else if the splitaddress below block0 of SRAM, configured as 0x11, else if splitaddress higher than block0 of SRAM, configured as 0x00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_1</name>
              <description>category1 of core_x_iram0_dram_dma_line, if the splitaddress in block1 of SRAM, configured as 0x10, else if the splitaddress below block1 of SRAM, configured as 0x11, else if splitaddress higher than block1 of SRAM, configured as 0x00</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_2</name>
              <description>category2 of core_x_iram0_dram_dma_line, if the splitaddress in block2 of SRAM, configured as 0x10, else if the splitaddress below block2 of SRAM, configured as 0x11, else if splitaddress higher than block2 of SRAM, configured as 0x00</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_3</name>
              <description>category3 of core_x_iram0_dram_dma_line, if the splitaddress in block3 of SRAM, configured as 0x10, else if the splitaddress below block3 of SRAM, configured as 0x11, else if splitaddress higher than block3 of SRAM, configured as 0x00</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_4</name>
              <description>category4 of core_x_iram0_dram_dma_line, if the splitaddress in block4 of SRAM, configured as 0x10, else if the splitaddress below block4 of SRAM, configured as 0x11, else if splitaddress higher than block4 of SRAM, configured as 0x00</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_5</name>
              <description>category5 of core_x_iram0_dram_dma_line, if the splitaddress in block5 of SRAM, configured as 0x10, else if the splitaddress below block5 of SRAM, configured as 0x11, else if splitaddress higher than block5 of SRAM, configured as 0x00</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_CATEGORY_6</name>
              <description>category6 of core_x_iram0_dram_dma_line, if the splitaddress in block6 of SRAM, configured as 0x10, else if the splitaddress below block6 of SRAM, configured as 0x11, else if splitaddress higher than block6 of SRAM, configured as 0x00</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_DRAM0_DMA_SRAM_SPLITADDR</name>
              <description>splitaddr of core_x_iram0_dram_dma_line, configured as [15:8]bit of actual address</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_2</name>
          <description>sram split line configuration register 1</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_0</name>
              <description>category0 of core_x_iram0_dram_dma_line, if the splitaddress in block0 of SRAM, configured as 0x10, else if the splitaddress below block0 of SRAM, configured as 0x11, else if splitaddress higher than block0 of SRAM, configured as 0x00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_1</name>
              <description>category1 of core_x_iram0_dram_dma_line, if the splitaddress in block1 of SRAM, configured as 0x10, else if the splitaddress below block1 of SRAM, configured as 0x11, else if splitaddress higher than block1 of SRAM, configured as 0x00</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_2</name>
              <description>category2 of core_x_iram0_dram_dma_line, if the splitaddress in block2 of SRAM, configured as 0x10, else if the splitaddress below block2 of SRAM, configured as 0x11, else if splitaddress higher than block2 of SRAM, configured as 0x00</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_3</name>
              <description>category3 of core_x_iram0_dram_dma_line, if the splitaddress in block3 of SRAM, configured as 0x10, else if the splitaddress below block3 of SRAM, configured as 0x11, else if splitaddress higher than block3 of SRAM, configured as 0x00</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_4</name>
              <description>category4 of core_x_iram0_dram_dma_line, if the splitaddress in block4 of SRAM, configured as 0x10, else if the splitaddress below block4 of SRAM, configured as 0x11, else if splitaddress higher than block4 of SRAM, configured as 0x00</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_5</name>
              <description>category5 of core_x_iram0_dram_dma_line, if the splitaddress in block5 of SRAM, configured as 0x10, else if the splitaddress below block5 of SRAM, configured as 0x11, else if splitaddress higher than block5 of SRAM, configured as 0x00</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_CATEGORY_6</name>
              <description>category6 of core_x_iram0_dram_dma_line, if the splitaddress in block6 of SRAM, configured as 0x10, else if the splitaddress below block6 of SRAM, configured as 0x11, else if splitaddress higher than block6 of SRAM, configured as 0x00</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_IRAM0_SRAM_LINE_0_SPLITADDR</name>
              <description>splitaddr of core_x_iram0_dram_dma_line, configured as [15:8]bit of actual address</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
