espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>CORE_1_IRAM0_PMS_MONITOR_2</name>
          <description>core1 iram0 permission monitor configuration register 2</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_INTR</name>
              <description>recorded core1 iram0 pms monitor interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>recorded core1 iram0 wr status, only if loadstore is 1 have meaning, 1(store), 0(load).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_STATUS_LOADSTORE</name>
              <description>recorded core1 iram0 loadstore status, indicated the type of operation, 0(fetch), 1(load/store).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>recorded core1 iram0 world status, 0x01 means world0, 0x10 means world1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>recorded core1 iram0 address [25:2] status when core1 iram0 violated permission, the real address is 0x40000000+addr*4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_DRAM0_PMS_CONSTRAIN_0</name>
          <description>corex dram0 permission configuration register 0</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock corex dram0 permission configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_DRAM0_PMS_CONSTRAIN_1</name>
          <description>corex dram0 permission configuration register 1</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_0</name>
              <description>core0/core1's permission of data region0 of SRAM in world0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_1</name>
              <description>core0/core1's permission of data region1 of SRAM in world0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_2</name>
              <description>core0/core1's permission of data region2 of SRAM in world0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_PMS_3</name>
              <description>core0/core1's permission of data region3 of SRAM in world0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_CACHEDATAARRAY_PMS_0</name>
              <description>core0/core1's permission of dcache data sram block0 in world0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_0_CACHEDATAARRAY_PMS_1</name>
              <description>core0/core1's permission of dcache data sram block1 in world0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_0</name>
              <description>core0/core1's permission of data region0 of SRAM in world1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_1</name>
              <description>core0/core1's permission of data region1 of SRAM in world1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_2</name>
              <description>core0/core1's permission of data region2 of SRAM in world1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_PMS_3</name>
              <description>core0/core1's permission of data region3 of SRAM in world1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_CACHEDATAARRAY_PMS_0</name>
              <description>core0/core1's permission of dcache data sram block0 in world1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_SRAM_WORLD_1_CACHEDATAARRAY_PMS_1</name>
              <description>core0/core1's permission of dcache data sram block1 in world1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_ROM_WORLD_0_PMS</name>
              <description>core0/core1's permission(sotre,load) of rom in world0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_X_DRAM0_PMS_CONSTRAIN_ROM_WORLD_1_PMS</name>
              <description>core0/core1's permission(sotre,load) of rom in world1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_0</name>
          <description>core0 dram0 permission monitor configuration register 0</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_LOCK</name>
              <description>Set 1 to lock core0 dram0 permission monitor configuration register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_1</name>
          <description>core0 dram0 permission monitor configuration register 1</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_CLR</name>
              <description>Set 1 to clear core0 dram0 permission monior interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_EN</name>
              <description>Set 1 to enable core0 dram0 permission monitor interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_2</name>
          <description>core0 dram0 permission monitor configuration register 2.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR</name>
              <description>recorded core0 dram0 permission monitor interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_LOCK</name>
              <description>recorded core0 dram0 lock status, 1 means s32c1i access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>recorded core0 dram0 world status, 0x1 means world0, 0x2 means world1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>recorded core0 dram0 address[25:4] status when core0 dram0 violated permission,the real address is 0x3c000000+addr*16</description>
              <bitOffset>4</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_PMS_MONITOR_3</name>
          <description>core0 dram0 permission monitor configuration register 3.</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>recorded core0 dram0 wr status, 1 means store, 0 means load.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_PMS_MONITOR_VIOLATE_STATUS_BYTEEN</name>
              <description>recorded core0 dram0 byteen status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_PMS_MONITOR_0</name>
          <description>core1 dram0 permission monitor configuration register 0</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_LOCK</name>
              <description>Set 1 to lock core1 dram0 permission monitor configuration register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_PMS_MONITOR_1</name>
          <description>core1 dram0 permission monitor configuration register 1</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_CLR</name>
              <description>Set 1 to clear core1 dram0 permission monior interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_EN</name>
              <description>Set 1 to enable core1 dram0 permission monitor interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_PMS_MONITOR_2</name>
          <description>core1 dram0 permission monitor configuration register 2.</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_INTR</name>
              <description>recorded core1 dram0 permission monitor interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_STATUS_LOCK</name>
              <description>recorded core1 dram0 lock status, 1 means s32c1i access.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_STATUS_WORLD</name>
              <description>recorded core1 dram0 world status, 0x1 means world0, 0x2 means world1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_STATUS_ADDR</name>
              <description>recorded core1 dram0 address[25:4] status when core1 dram0 violated permission,the real address is 0x3c000000+addr*16</description>
              <bitOffset>4</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_PMS_MONITOR_3</name>
          <description>core1 dram0 permission monitor configuration register 3.</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_STATUS_WR</name>
              <description>recorded core1 dram0 wr status, 1 means store, 0 means load.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_PMS_MONITOR_VIOLATE_STATUS_BYTEEN</name>
              <description>recorded core1 dram0 byteen status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_0</name>
          <description>Core0 access peripherals permission configuration register 0.</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_LOCK</name>
              <description>Set 1 to lock core0 access peripherals permission Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_PIF_PMS_CONSTRAIN_1</name>
          <description>Core0 access peripherals permission configuration register 1.</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <resetValue>0xFF33CFFF</resetValue>
          <fields>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_UART</name>
              <description>Core0 access uart permission in world0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_G0SPI_1</name>
              <description>Core0 access g0spi_1 permission in world0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_G0SPI_0</name>
              <description>Core0 access g0spi_0 permission in world0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_GPIO</name>
              <description>Core0 access gpio permission in world0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_FE2</name>
              <description>Core0 access fe2 permission in world0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_FE</name>
              <description>Core0 access fe permission in world0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_RTC</name>
              <description>Core0 access rtc permission in world0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX</name>
              <description>Core0 access io_mux permission in world0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_HINF</name>
              <description>Core0 access hinf permission in world0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_MISC</name>
              <description>Core0 access misc permission in world0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_I2C</name>
              <description>Core0 access i2c permission in world0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_I2S0</name>
              <description>Core0 access i2s0 permission in world0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_PIF_PMS_CONSTRAIN_WORLD_0_UART1</name>
              <description>Core0 access uart1 permission in world0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
