espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
        <register>
          <name>CORE_1_PIF_PMS_CONSTRAIN_1</name>
          <description>Core1 access peripherals permission configuration register 1.</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <resetValue>0xFF33CFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART</name>
              <description>Core1 access uart permission in world0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_G0SPI_1</name>
              <description>Core1 access g0spi_1 permission in world0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_G0SPI_0</name>
              <description>Core1 access g0spi_0 permission in world0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_GPIO</name>
              <description>Core1 access gpio permission in world0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_FE2</name>
              <description>Core1 access fe2 permission in world0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_FE</name>
              <description>Core1 access fe permission in world0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RTC</name>
              <description>Core1 access rtc permission in world0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_IO_MUX</name>
              <description>Core1 access io_mux permission in world0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_HINF</name>
              <description>Core1 access hinf permission in world0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_MISC</name>
              <description>Core1 access misc permission in world0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C</name>
              <description>Core1 access i2c permission in world0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S0</name>
              <description>Core1 access i2s0 permission in world0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART1</name>
              <description>Core1 access uart1 permission in world0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_CONSTRAIN_2</name>
          <description>Core1 access peripherals permission configuration register 2.</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFCFFFF3</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_BT</name>
              <description>Core1 access bt permission in world0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C_EXT0</name>
              <description>Core1 access i2c_ext0 permission in world0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UHCI0</name>
              <description>Core1 access uhci0 permission in world0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SLCHOST</name>
              <description>Core1 access slchost permission in world0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RMT</name>
              <description>Core1 access rmt permission in world0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_PCNT</name>
              <description>Core1 access pcnt permission in world0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SLC</name>
              <description>Core1 access slc permission in world0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_LEDC</name>
              <description>Core1 access ledc permission in world0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_BACKUP</name>
              <description>Core1 access backup permission in world0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_BB</name>
              <description>Core1 access bb permission in world0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_PWM0</name>
              <description>Core1 access pwm0 permission in world0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_TIMERGROUP</name>
              <description>Core1 access timergroup permission in world0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_TIMERGROUP1</name>
              <description>Core1 access timergroup1 permission in world0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SYSTIMER</name>
              <description>Core1 access systimer permission in world0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_CONSTRAIN_3</name>
          <description>Core1 access peripherals permission configuration register 3.</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x3CC3FFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SPI_2</name>
              <description>Core1 access spi_2 permission in world0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SPI_3</name>
              <description>Core1 access spi_3 permission in world0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_APB_CTRL</name>
              <description>Core1 access apb_ctrl permission in world0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2C_EXT1</name>
              <description>Core1 access i2c_ext1 permission in world0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SDIO_HOST</name>
              <description>Core1 access sdio_host permission in world0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_CAN</name>
              <description>Core1 access can permission in world0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_PWM1</name>
              <description>Core1 access pwm1 permission in world0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_I2S1</name>
              <description>Core1 access i2s1 permission in world0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_UART2</name>
              <description>Core1 access uart2 permission in world0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_RWBT</name>
              <description>Core1 access rwbt permission in world0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_WIFIMAC</name>
              <description>Core1 access wifimac permission in world0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_PWR</name>
              <description>Core1 access pwr permission in world0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_CONSTRAIN_4</name>
          <description>Core1 access peripherals permission configuration register 4.</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_USB_DEVICE</name>
              <description>Core1 access usb_device permission in world0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_USB_WRAP</name>
              <description>Core1 access usb_wrap permission in world0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_CRYPTO_PERI</name>
              <description>Core1 access crypto_peri permission in world0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_CRYPTO_DMA</name>
              <description>Core1 access crypto_dma permission in world0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_APB_ADC</name>
              <description>Core1 access apb_adc permission in world0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_LCD_CAM</name>
              <description>Core1 access lcd_cam permission in world0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_BT_PWR</name>
              <description>Core1 access bt_pwr permission in world0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_USB</name>
              <description>Core1 access usb permission in world0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SYSTEM</name>
              <description>Core1 access system permission in world0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_SENSITIVE</name>
              <description>Core1 access sensitive permission in world0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_INTERRUPT</name>
              <description>Core1 access interrupt permission in world0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_DMA_COPY</name>
              <description>Core1 access dma_copy permission in world0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_CACHE_CONFIG</name>
              <description>Core1 access cache_config permission in world0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_AD</name>
              <description>Core1 access ad permission in world0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_DIO</name>
              <description>Core1 access dio permission in world0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_0_WORLD_CONTROLLER</name>
              <description>Core1 access world_controller permission in world0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_PIF_PMS_CONSTRAIN_5</name>
          <description>Core1 access peripherals permission configuration register 5.</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <resetValue>0xFF33CFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_UART</name>
              <description>Core1 access uart permission in world1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_G0SPI_1</name>
              <description>Core1 access g0spi_1 permission in world1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_G0SPI_0</name>
              <description>Core1 access g0spi_0 permission in world1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_GPIO</name>
              <description>Core1 access gpio permission in world1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_FE2</name>
              <description>Core1 access fe2 permission in world1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_FE</name>
              <description>Core1 access fe permission in world1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_RTC</name>
              <description>Core1 access rtc permission in world1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_IO_MUX</name>
              <description>Core1 access io_mux permission in world1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_HINF</name>
              <description>Core1 access hinf permission in world1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_MISC</name>
              <description>Core1 access misc permission in world1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_I2C</name>
              <description>Core1 access i2c permission in world1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_I2S0</name>
              <description>Core1 access i2s0 permission in world1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_PIF_PMS_CONSTRAIN_WORLD_1_UART1</name>
              <description>Core1 access uart1 permission in world1.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
