espressif/arduino-esp32/tools/ide-debug/svd/esp32s3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WCL</name>
      <description>Peripheral WCL</description>
      <groupName>WCL</groupName>
      <baseAddress>0x600D0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x160</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>Core_0_ENTRY_1_ADDR</name>
          <description>Core_0 Entry 1 address configuration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_1_ADDR</name>
              <description>Core_0 Entry 1 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_2_ADDR</name>
          <description>Core_0 Entry 2 address configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_2_ADDR</name>
              <description>Core_0 Entry 2 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_3_ADDR</name>
          <description>Core_0 Entry 3 address configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_3_ADDR</name>
              <description>Core_0 Entry 3 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_4_ADDR</name>
          <description>Core_0 Entry 4 address configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_4_ADDR</name>
              <description>Core_0 Entry 4 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_5_ADDR</name>
          <description>Core_0 Entry 5 address configuration Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_5_ADDR</name>
              <description>Core_0 Entry 5 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_6_ADDR</name>
          <description>Core_0 Entry 6 address configuration Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_6_ADDR</name>
              <description>Core_0 Entry 6 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_7_ADDR</name>
          <description>Core_0 Entry 7 address configuration Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_7_ADDR</name>
              <description>Core_0 Entry 7 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_8_ADDR</name>
          <description>Core_0 Entry 8 address configuration Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_8_ADDR</name>
              <description>Core_0 Entry 8 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_9_ADDR</name>
          <description>Core_0 Entry 9 address configuration Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_9_ADDR</name>
              <description>Core_0 Entry 9 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_10_ADDR</name>
          <description>Core_0 Entry 10 address configuration Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_10_ADDR</name>
              <description>Core_0 Entry 10 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_11_ADDR</name>
          <description>Core_0 Entry 11 address configuration Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_11_ADDR</name>
              <description>Core_0 Entry 11 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_12_ADDR</name>
          <description>Core_0 Entry 12 address configuration Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_12_ADDR</name>
              <description>Core_0 Entry 12 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_13_ADDR</name>
          <description>Core_0 Entry 13 address configuration Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_ENTRY_13_ADDR</name>
              <description>Core_0 Entry 13 address from WORLD1 to WORLD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_ENTRY_CHECK</name>
          <description>Core_0 Entry check configuration Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>CORE_0_ENTRY_CHECK</name>
              <description>This filed is used to enable entry address check</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE1</name>
          <description>Status register of world switch of entry 1</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_1</name>
              <description>This bit is used to confirm world before enter entry 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_1</name>
              <description>This filed is used to confirm in which entry before enter entry 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_1</name>
              <description>This bit is used to confirm whether the current state is in entry 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE2</name>
          <description>Status register of world switch of entry 2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_2</name>
              <description>This bit is used to confirm world before enter entry 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_2</name>
              <description>This filed is used to confirm in which entry before enter entry 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_2</name>
              <description>This bit is used to confirm whether the current state is in entry 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE3</name>
          <description>Status register of world switch of entry 3</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_3</name>
              <description>This bit is used to confirm world before enter entry 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_3</name>
              <description>This filed is used to confirm in which entry before enter entry 3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_3</name>
              <description>This bit is used to confirm whether the current state is in entry 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE4</name>
          <description>Status register of world switch of entry 4</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_4</name>
              <description>This bit is used to confirm world before enter entry 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_4</name>
              <description>This filed is used to confirm in which entry before enter entry 4</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_4</name>
              <description>This bit is used to confirm whether the current state is in entry 4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE5</name>
          <description>Status register of world switch of entry 5</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_5</name>
              <description>This bit is used to confirm world before enter entry 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_5</name>
              <description>This filed is used to confirm in which entry before enter entry 5</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_5</name>
              <description>This bit is used to confirm whether the current state is in entry 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE6</name>
          <description>Status register of world switch of entry 6</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_6</name>
              <description>This bit is used to confirm world before enter entry 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_6</name>
              <description>This filed is used to confirm in which entry before enter entry 6</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_6</name>
              <description>This bit is used to confirm whether the current state is in entry 6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE7</name>
          <description>Status register of world switch of entry 7</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_7</name>
              <description>This bit is used to confirm world before enter entry 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_7</name>
              <description>This filed is used to confirm in which entry before enter entry 7</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_7</name>
              <description>This bit is used to confirm whether the current state is in entry 7</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE8</name>
          <description>Status register of world switch of entry 8</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_8</name>
              <description>This bit is used to confirm world before enter entry 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_8</name>
              <description>This filed is used to confirm in which entry before enter entry 8</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_8</name>
              <description>This bit is used to confirm whether the current state is in entry 8</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE9</name>
          <description>Status register of world switch of entry 9</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_9</name>
              <description>This bit is used to confirm world before enter entry 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_9</name>
              <description>This filed is used to confirm in which entry before enter entry 9</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_9</name>
              <description>This bit is used to confirm whether the current state is in entry 9</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE10</name>
          <description>Status register of world switch of entry 10</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_10</name>
              <description>This bit is used to confirm world before enter entry 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_10</name>
              <description>This filed is used to confirm in which entry before enter entry 10</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_10</name>
              <description>This bit is used to confirm whether the current state is in entry 10</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE11</name>
          <description>Status register of world switch of entry 11</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_11</name>
              <description>This bit is used to confirm world before enter entry 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_11</name>
              <description>This filed is used to confirm in which entry before enter entry 11</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_11</name>
              <description>This bit is used to confirm whether the current state is in entry 11</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Core_0_STATUSTABLE12</name>
          <description>Status register of world switch of entry 12</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_0_FROM_WORLD_12</name>
              <description>This bit is used to confirm world before enter entry 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_FROM_ENTRY_12</name>
              <description>This filed is used to confirm in which entry before enter entry 12</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_CURRENT_12</name>
              <description>This bit is used to confirm whether the current state is in entry 12</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
